In [1]:
 import pandas as pd
import numpy as np

In [22]:
#1. make a dic. with employee data colum name(name, age, add., qualification) which is having 10 datapoints

In [23]:
# creating a data frame using a dictionary
dict1={'name':['Pawan','Fenil','Jay','Akash','Keyur','Priya','Rashi','Ashish','Bhavesh','Niki'],
       'age':['23','24','23','22','24','22','23','24','22','24'],
       'address':['Surat','Surat','Ahmedabad','Valsad','Navsari','Mumbai','Jaipur','Surat','Ahmedabad','Jodhpur'],
       'qualification':['B-tech','B-tech','B.com','BBA','MBA','CS','M-tech','B-tech','BCA','M.com']}
print(dict1)

{'name': ['Pawan', 'Fenil', 'Jay', 'Akash', 'Keyur', 'Priya', 'Rashi', 'Ashish', 'Bhavesh', 'Niki'], 'age': ['23', '24', '23', '22', '24', '22', '23', '24', '22', '24'], 'address': ['Surat', 'Surat', 'Ahmedabad', 'Valsad', 'Navsari', 'Mumbai', 'Jaipur', 'Surat', 'Ahmedabad', 'Jodhpur'], 'qualification': ['B-tech', 'B-tech', 'B.com', 'BBA', 'MBA', 'CS', 'M-tech', 'B-tech', 'BCA', 'M.com']}

In [24]:
df=pd.DataFrame(dict1)
print(df)

      name age    address qualification
0    Pawan  23      Surat        B-tech
1    Fenil  24      Surat        B-tech
2      Jay  23  Ahmedabad         B.com
3    Akash  22     Valsad           BBA
4    Keyur  24    Navsari           MBA
5    Priya  22     Mumbai            CS
6    Rashi  23     Jaipur        M-tech
7   Ashish  24      Surat        B-tech
8  Bhavesh  22  Ahmedabad           BCA
9     Niki  24    Jodhpur         M.com

In [25]:
len(df)

10

In [5]:
#2. change the default index to abcd...

In [26]:
df2=pd.DataFrame(dict1,index=['A','B','C','D','E','F','H','I','J','K'])
print(df2)

      name age    address qualification
A    Pawan  23      Surat        B-tech
B    Fenil  24      Surat        B-tech
C      Jay  23  Ahmedabad         B.com
D    Akash  22     Valsad           BBA
E    Keyur  24    Navsari           MBA
F    Priya  22     Mumbai            CS
H    Rashi  23     Jaipur        M-tech
I   Ashish  24      Surat        B-tech
J  Bhavesh  22  Ahmedabad           BCA
K     Niki  24    Jodhpur         M.com

In [ ]:
#3. add nuw colum name designation

In [27]:
df['Designation']=['Student','Supervisor','J.Manager','SeniorEditor',np.nan,'Student','Professor','Manager','DAO','CEO']

In [28]:
df

      name age    address qualification   Designation
0    Pawan  23      Surat        B-tech       Student
1    Fenil  24      Surat        B-tech    Supervisor
2      Jay  23  Ahmedabad         B.com     J.Manager
3    Akash  22     Valsad           BBA  SeniorEditor
4    Keyur  24    Navsari           MBA           NaN
5    Priya  22     Mumbai            CS       Student
6    Rashi  23     Jaipur        M-tech     Professor
7   Ashish  24      Surat        B-tech       Manager
8  Bhavesh  22  Ahmedabad           BCA           DAO
9     Niki  24    Jodhpur         M.com           CEO

In [ ]:
#4. add new raw of a new data of employee

In [30]:
len(df)

10

In [35]:
df.loc[len(df)] = ['pooja', 22, 'surat', 'arts','student']

In [36]:
df

       name age    address qualification   Designation
0     Pawan  23      Surat        B-tech       Student
1     Fenil  24      Surat        B-tech    Supervisor
2       Jay  23  Ahmedabad         B.com     J.Manager
3     Akash  22     Valsad           BBA  SeniorEditor
4     Keyur  24    Navsari           MBA           NaN
5     Priya  22     Mumbai            CS       Student
6     Rashi  23     Jaipur        M-tech     Professor
7    Ashish  24      Surat        B-tech       Manager
8   Bhavesh  22  Ahmedabad           BCA           DAO
9      Niki  24    Jodhpur         M.com           CEO
10    pooja  22      surat          arts       student
11    pooja  22      surat          arts       student
12    pooja  22      surat          arts       student
13    pooja  22      surat          arts       student

In [ ]:
#next lec. practice

In [12]:
#task
#1. make a dataframe student coume1-mathes marks out of 50 , colum2-science marks out of 50 , 
#for 10 data-4 missing in math, 3 missing in science

# creating a data frame using a dictionary
dict2={'name':['Pawan','Fenil','Jay','Akash','Keyur','Priya','Rashi','Ashish','Bhavesh','Niki'],
       'Maths':['83',np.nan,np.nan,'52','24',np.nan,'93',np.nan,'92','24'],
       'Science':['98','38','58','76',np.nan,'22',np.nan,'84','91',np.nan]}
print(dict2)

{'name': ['Pawan', 'Fenil', 'Jay', 'Akash', 'Keyur', 'Priya', 'Rashi', 'Ashish', 'Bhavesh', 'Niki'], 'Maths': ['83', nan, nan, '52', '24', nan, '93', nan, '92', '24'], 'Science': ['98', '38', '58', '76', nan, '22', nan, '84', '91', nan]}

In [13]:
df=pd.DataFrame(dict2)
print(df)

      name Maths Science
0    Pawan    83      98
1    Fenil   NaN      38
2      Jay   NaN      58
3    Akash    52      76
4    Keyur    24     NaN
5    Priya   NaN      22
6    Rashi    93     NaN
7   Ashish   NaN      84
8  Bhavesh    92      91
9     Niki    24     NaN

In [14]:
# change index
df0=pd.DataFrame(dict2,index=['A','B','C','D','E','F','H','I','J','K'])
print(df0)

      name Maths Science
A    Pawan    83      98
B    Fenil   NaN      38
C      Jay   NaN      58
D    Akash    52      76
E    Keyur    24     NaN
F    Priya   NaN      22
H    Rashi    93     NaN
I   Ashish   NaN      84
J  Bhavesh    92      91
K     Niki    24     NaN

In [20]:
#2. inpute the missing value by mean of the colum
#maths
df0['Maths'].fillna('24')

A    83
B    24
C    24
D    52
E    24
F    24
H    93
I    24
J    92
K    24
Name: Maths, dtype: object

In [21]:
df0['Science'].fillna('22')

A    98
B    38
C    58
D    76
E    22
F    22
H    22
I    84
J    91
K    22
Name: Science, dtype: object

In [23]:
#3. make a 3rd colum grade avrage which is avg. of math and science
df['avrage']=['94','32','52','74','22','22','21','85','89','24']

In [24]:
df

      name Maths Science avrage
0    Pawan    83      98     94
1    Fenil   NaN      38     32
2      Jay   NaN      58     52
3    Akash    52      76     74
4    Keyur    24     NaN     22
5    Priya   NaN      22     22
6    Rashi    93     NaN     21
7   Ashish   NaN      84     85
8  Bhavesh    92      91     89
9     Niki    24     NaN     24

In [25]:
#4. make a 4th colum grade if marks is greater than 50 grade A else grade B
df['grade']=['A','B','A','A','B','B','B','A','A','B']

In [26]:
df

      name Maths Science avrage grade
0    Pawan    83      98     94     A
1    Fenil   NaN      38     32     B
2      Jay   NaN      58     52     A
3    Akash    52      76     74     A
4    Keyur    24     NaN     22     B
5    Priya   NaN      22     22     B
6    Rashi    93     NaN     21     B
7   Ashish   NaN      84     85     A
8  Bhavesh    92      91     89     A
9     Niki    24     NaN     24     B